const firstName = "John";
const secondName = "Michael";
const thirdName = "Zach";
const lastName = "Doe";
const fullName = firstName + " " + lastName;

// 1. 1stName - починається з цифри
// 2. full-name - містить дефіс, який не дозволений у назвах змінних
// 3. $age - містить спеціальний символ, який зазвичай використовується для позначення змінних типу "об'єкт"
// 4. let - співпадає з назвою ключового слова, що використовується для оголошення змінних
// 5. this - співпадає з ключовим словом, яке використовується для посилання на поточний об'єкт

// Однорядковий коментар //коментар
// Багаторядковий коментар /*коментар*/
 
// myFirstName - перша літера кожного слова, крім першого, з великої літери.
// MyFirstName - кожне слово починається з великої літери.
// my_first_name - слова розділяються символом підкреслення.
// my-first-name - слова розділяються дефісом.
// MYFIRSTNAME - всі літери великі.
// myfirstname - всі літери маленькі.